In [9]:
import numpy as np
import pandas as pd

In [10]:
df1 = pd.DataFrame(np.arange(12).reshape(3, 4))
print(df1)

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [14]:
#竖轴变横轴，横轴变竖轴
df1.T

   0  1   2
0  0  4   8
1  1  5   9
2  2  6  10
3  3  7  11

In [19]:
#axis=0是竖轴排序
df1.sort_index(axis=0,ascending=False)

   0  1   2   3
2  8  9  10  11
1  4  5   6   7
0  0  1   2   3

In [20]:
df1.sort_index(axis=1,ascending=False)

    3   2  1  0
0   3   2  1  0
1   7   6  5  4
2  11  10  9  8

In [21]:
df1.T.sort_index(axis=0,ascending=False)

   0  1   2
3  3  7  11
2  2  6  10
1  1  5   9
0  0  4   8

In [22]:
df1.describe()

         0    1     2     3
count  3.0  3.0   3.0   3.0
mean   4.0  5.0   6.0   7.0
std    4.0  4.0   4.0   4.0
min    0.0  1.0   2.0   3.0
25%    2.0  3.0   4.0   5.0
50%    4.0  5.0   6.0   7.0
75%    6.0  7.0   8.0   9.0
max    8.0  9.0  10.0  11.0

In [28]:
df1.sort_values(by=1,axis=1,ascending=False)

    3   2  1  0
0   3   2  1  0
1   7   6  5  4
2  11  10  9  8